<a href="https://colab.research.google.com/github/mvvilori/DS-Coding-Dojo/blob/main/Titanic_Core.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [118]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [119]:
import pandas as pd

In [120]:
filename = '/content/titanic.csv'
df = pd.read_csv(filename)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [121]:
#1 Display head of the dataframe
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [122]:
df['Sex'].interpolate(method = 'bfill')

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [123]:
df['Age'].fillna(df['Age'].mean(), inplace = True)

In [124]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [125]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [126]:
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [127]:
#2Q.What is the percentage of people who survived? (hint: find the mean of the survival column).
df['Survived'].value_counts(normalize=True)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

In [128]:
#2A.Survival rate is 38%
df.survived = df['Survived'].mean()
print(df.survived)

0.3838383838383838

In [129]:
#3Q. How many of each sex survived?
dfsex = df[df['Survived'] ==1]
dfsex['PassengerId'].count()

342

In [130]:
#3A. Each Sex is 233 F & 109 M
dfsex['Sex'].value_counts()

female    233
male      109
Name: Sex, dtype: int64

In [138]:
#4Q. Considering only the group of passengers who paid less than $10, what percentage of this group survived?

dffare = dfsex['Fare'] <= 10
dffare.value_counts()

False    275
True      67
Name: Fare, dtype: int64

In [139]:
#4A. 19%
dffare.mean()

0.195906432748538

In [143]:
#5Q. Overall, what is the average age of those who didn't survive?
dfdead = df[df['Survived'] ==0]
dfdead['PassengerId'].count()

549

In [150]:
#5A. 30% Death rate
dfdead['Age'].mean()

30.415099646415943

In [151]:
#6Q. Overall, what is the average age of those who did survive?
dfalive = df[df['Survived'] ==1]
dfalive['PassengerId'].count()

342

In [152]:
#6A. 28% Survival rate
dfalive['Age'].mean()

28.549778121775027

In [160]:
#7Q.What is the average age of those who did and didn't survive grouped by Sex?
#7A. 0 = Dead, 1 = Survived
df.groupby(['Survived', 'Sex'])['Age'].mean()

Survived  Sex
0         female    26.023272
          male      31.175224
1         female    28.979263
          male      27.631705
Name: Age, dtype: float64